a = [
  ['帳號','密碼','餘款'],
  ['123','456','9000'],
  ['456','789','5000'],
  ['789','888','6000'],
  ['336','558','10000'],
  ['775','666','12000'],
  ['566','221','7000']]

b = int(input('欲查詢幾組'))

while b > 0:
  o = input('請依序輸入帳號及密碼(中間以空白鍵隔開)').split()
  if o[0] == '123' and o[1] == '456':
    print(a[1][2])
  elif o[0] == '456' and o[1] == '789':
    print(a[2][2])
  elif o[0] == '789' and o[1] == '888':
    print(a[3][2])
  elif o[0] == '336' and o[1] == '558':
    print(a[4][2])
  elif o[0] == '775' and o[1] == '666':
    print(a[5][2])
  elif o[0] == '566' and o[1] == '221':
    print(a[6][2])
  else:
    print('ERROR')
  b -= 1


 
